{
  "_name_or_path": "../deberta-v3-large",
  "architectures": [
    "DebertaV2ForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 1024,
  "id2label": {
    "0": "SOLUTION-CORRECT",
    "1": "SOLUTION-INCORRECT",
    "2": "STEP-CORRECT",
    "3": "STEP-INCORRECT",
    "4": "O"
  },
  "initializer_range": 0.02,
  "intermediate_size": 4096,
  "label2id": {
    "O": 4,
    "SOLUTION-CORRECT": 0,
    "SOLUTION-INCORRECT": 1,
    "STEP-CORRECT": 2,
    "STEP-INCORRECT": 3
  },
  "layer_norm_eps": 1e-07,
  "max_position_embeddings": 512,
  "max_relative_positions": -1,
  "model_type": "deberta-v2",
  "norm_rel_ebd": "layer_norm",
  "num_attention_heads": 16,
  "num_hidden_layers": 24,
  "pad_token_id": 0,
  "pooler_dropout": 0,
  "pooler_hidden_act": "gelu",
  "pooler_hidden_size": 1024,
  "pos_att_type": [
    "p2c",
    "c2p"
  ],
  "position_biased_input": false,
  "position_buckets": 256,
  "relative_attention": true,
  "share_att_key": true,
  "task_specific_params": {
    "other_label_loss_weight": 0.0,
    "solution_correct_loss_weight": 1.0,
    "solution_incorrect_loss_weight": 1.0,
    "step_correct_loss_weight": 0.1,
    "step_incorrect_loss_weight": 0.1
  },
  "torch_dtype": "float32",
  "transformers_version": "4.38.2",
  "type_vocab_size": 0,
  "vocab_size": 128100
}
